def print_menu():
    print("""MENU\n
밥                       국
<1> 갈배제육              <2> 돼지김치짜글이
<3> 고등어 갈비구이        <4> 들깨배춧국
<5> 오이부추무침           <6> 미역국
<7> 돼지목살 간장구이       <8> 소고기 뭇국
<9> 상추 겉절이           <10> 콩나물 국
<11> 두부조림
<13> 무 고등어 조림   
<15> 

<0> 처음으로""")
def print_side_dish():
    print("""밥
<1> 갈배제육
<3> 고등어 갈비구이
<5> 오이부추무침
<7> 돼지목살 간장구이
<9> 상추 겉절이
<11> 두부조림
<13> 무 고등어 조림
<15> 
          
<0> 처음으로\n""")
def print_soup():
    print("""국
<2> 돼지김치짜글이
<4> 들깨배춧국
<6> 미역국
<8> 소고기 뭇국
<10> 콩나물국

<0> 처음으로\n""")