def print_JJagle():
    print("""<2> 돼지김치짜글이\n
주재료                   양념
1. 앞다리 살              1. 들기름 반스푼
2. 신김치 반포기 이하       2. 올리브유 반스푼
3. 대파                  3. 고추장 한스푼
4. 양파 반개              4. 고춧가루 한스푼
                        5. 다진 마늘 한스푼
                        6. 간장 한스푼
                        7. 설탕 한스푼
                        8. 맛술 반스푼
                        9. 후추 살짝\n
만드는 법
1. 앞다리 살에 맛술과 후추를 뿌려 30분가량 상온에 놔둔다
1-1. 위 과정은 고기의 잡내를 잡기 위함이며 하지 않아도 상관없다
2. 냄비에 들기름 반, 올리브유 반을 부은 후 파와 함께 살짝 볶으며 파기름을 내준다
3. 고기를 넣어 중불로 2,3분 가량 볶아준다
3-1. 이때 고기를 재지 않았으면 맛술 반스푼과 후추를 살짝 뿌려준다
4. 고추장 한스푼, 고춧가루 한스푼, 다진 마늘 한스푼, 설탕 한스푼, 간장 한스푼을 넣어 중불로 2분가량 볶아준다
4-1. 위의 양념은 자신의 입맛에 따라 가감한다
5. 얇게 썬 김치와 양파를 넣어 같이 볶아준다
5-1. 이때 김치를 그냥 썰어 넣으면 김치의 속과 김치 국물에 의해 너무 짜질 수 있으니 칼로 속을 긁어내고 김치를 어느 정도 짜준다.
6. 양파가 반투명하게 변하면 물을 700ml 가량 넣어준다
7. 강불로 끓이며 적당히 졸인다\n""")
def print_Perilla_Kimchi():
    print("""<4> 들깨 배춧국\n
주재료                 양념
1. 무 200g            1. 다진 마늘 한스푼
2. 배추 3장            2. 국간장 1.5스푼
3. 다진 파 한스푼       3. 소금 한스푼
                      4. 들깨가루 세스푼\n
만드는 법
1. 무를 썰어준다.
1-1. 이때 나박썰기를 해도 되고 일반 뭇국 끓이듯이 네모 얇게 썰어도 된다.
2. 육수를 우려준다.
2-1. 이때 육수를 우려주지 않아도 된다.
3. 무와 배추를 넣어 맛을 우려준다.
4. 어느 정도 무가 투명해지면 들깨가루를 제외한 양념을 넣고 끓여준다.
4-1. 국간장은 멸치 액젓으로 대체 가능하고 액젓과 소금은 입맛에 따라 가감한다. 소금은 나중에 넣어서 간을 맞춰도 된다.
5. 마지막에 들깨가루를 넣어 5분간 끓여준다.
5-1. 들깨가루의 양은 알아서 가감하기\n""")
def print_Seaweed_Soup():
    print("""<6> 미역국\n
주재료                     양념
1. 미역 2숟가락(5g)         1. 들기름 한스푼
2. 소고기 국거리용 50g       2. 국간장 1.5스푼
3. 물 600ml               3. 액젓 반스푼
                          4. 다진마늘 반스푼\n
만드는 법
1. 미역을 물에 넣고 10분에서 20분간 불려준다.
2. 냄비에 들기름 한스푼을 붓고 다진마늘과 함께 소고기를 살짝 볶아준다.
3. 불린 미역을 짠 후 국간장과 함께 볶은 소고기와 같이 볶아준다.
4. 5분에서 10분간 볶은 후 물을 부어준다.
5. 물을 붓고 액젓을 넣어준 후 끓인다.
5-1. 이때 액젓은 까나리, 멸치 등등 상관없다.
6. 계속 끓이면서 액젓이나 소금으로 간을 맞춘다.\n""")
def print_Beef_Bone_Soup():
    print("""<8> 소고기 뭇국\n
주재료                 양념
1. 소고기 300g         1. 국간장 두스푼
2. 무 400g            2. 멸치 액젓 한스푼
3. 대파 20cm           3. 다진 마늘 한스푼
                      4. 멸치 다시마 육수 1200ml
                      5. 후추 살짝\n
만드는 법
1. 무를 나박하게 썰어준다.
2. 냄비에 소고기를 넣고 국간장과 액젓, 다진 마늘과 후추를 넣어 볶아준다.
3. 고기 색깔이 어느정도 변하면 무를 넣고 같이 5분가량 볶아준다.
4. 육수를 붓고 끓여준다.
5. 강불로 5분가량 끓여준 후 대파를 넣어 끓여준다.\n""")
def print_Soybean_Sprout_Soup():
    print("""<10> 콩나물 국\n
주재료                 양념
1. 콩나물 200g         1. 청양고추 소량
2. 황태채 한줌          2. 다진 마늘 반스푼
3. 대파 15cm           3. 액젓 1.5스푼
                      4. 소금 약간
                      5. 육수 1200ml\n
만드는 법
1. 파는 어슷썰고 북어채는 흐르는 물에 가볍게 씻어준다.
2. 육수에 황태채를 넣고 끓여준다.
3. 이때 센불로 끓이다가 물이 끓으면, 중불로 4분간 끓인 후 잠시 불을 꺼준다.
3-1. 3분에서 4분간 불을 꺼주는데 이때 거품을 걷어주면 맑은 국물이 나온다.
4. 액젓과 다진 마늘을 넣고 강불로 물이 끓으면 콩나물과 대파를 넣어준다.
4-1. 이때 뚜껑을 완전 열거나 완전 닫아야 비린내가 나지 않는다.
5. 부족한 간은 소금으로 맞추고 청양 고추를 넣어주면 칼칼해진다.\n""")