
def print_gal():
    print("""<1> 갈배제육 만들기\n
주재료                          양념     
돼지고기 앞다리 살 600그램         고추장 듬뿍 세 숟갈
어슷 썬 대파                     간장 두 숟갈
양파 반개                        설탕 두 숟갈
소금 한 꼬집                     배 음료 한 캔
                               다진 마늘 한 숟갈 

                               식초 두 숟갈
                               참기름 한 숟갈\n
만드는 법
1. 고기의 핏물을 닦아 준다.
2. 고추장에서 다진 마늘까지의 양념을 잘 섞어준다.
3. 양념과 고기를 잘 섞어준 후 식초와 참기름을 넣어준다.(식초는 연육 적용과 감칠맛을 올려주고 보관 기간을 늘려주며 고기를 신맛은 볶을때 사라진다.)
4. 어슷 썬 채소들은 고기 위에 올려주고(섞기X) 소금 한 꼬집을 뿌려준다.\n
굽는 법
1. 고기를 먼저 올려 거뭇한 부분이 생길때까지 기다린다.(거뭇한 부위는 감칠맛을 올려줌)
2. 어느 정도 거뭇한 분이 생기면 채소들을 넣어 같이 볶아준 후 뚜껑을 덮고 약불로 3분을 익혀준다.
3. 마무리로 으깬 마늘을 한 숟갈 넣어 섞어주고 후추를 뿌려준다.\n""")
def print_gogalby():
    print("""<3> 고등어 갈비구이 만들기\n
주재료                   양념
1. 고등어 한마리          1. 밀가루
2. 다진 파 반움큼         2. 맛술

                        3. 고추장 한스푼
                        4. 고춧가루 한스푼
                        5. 다진 마늘 반스푼
                        6. 간장 반스푼
                        7. 들기름 한스푼
                        8. 설탕 반스푼
                        9. 올리고당 한스푼
                        10. 맛술 한스푼
                        11. 후추 살짝
                        12. 깨 적당히\n
만드는 법
1. 고등어를 물에 담근 후 맛술 한스푼, 후추 살짝, 밀가루 적당량을 넣어 비린내를 제거한다. 대략 30분
2. 양념들과 다진 파를 잘 섞어준다.
2-1. 여기서 양념은 자기 입맛에 따라 조절한다. 자반 고등어일 경우 간장은 한스푼이 아닌 살짝만 넣어도 된다.
3. 비린내를 제거한 고등어에 밀가루를 뿌리고 고등어를 굽는다.
3-1. 밀가루를 입혀주면 기름이 잘 튀지 않는다.
4. 앞뒤로 5~10분정도 구운 후 양념을 위에 골고루 발라준다.
5. 불을 약불로 줄이거나 완전히 끈 후 뚜껑을 덮어 3분가량 익혀준다.
5-1. 불을 끈 후 고등어를 뒤집어 반대편에도 양념을 발라준다. 굽는건 자기가 알아서 적당히.\n""")
def print_cucumber_muchim():
    print("""<4> 오이부추무침 만들기\n
주재료             양념
1. 오이 3개        1. 고춧가루 3큰술
2. 부추 한줌        2. 다진 마늘 반큰술
                  3. 액젓 1큰술
                  4.매실액 1큰술
                  5. 설탕 조금
                  6. 맛술 1큰술
                  7. 통깨 적당히\n
만드는 법
1. 부추와 오이를 씻은 후 오이는 길게 네토막 내준다.
1-1. 이때 오이는 굵은 소금으로 문질러서 씻어줘도 된다.
2. 굵은 소금을 한큰술 안되게 뿌려서 재워둔다.
3. 통깨를 제외한 위의 양념들을 섞어준다.
3-1. 이때 액젓과 매실액은 입맛에 따라 가감하고 오이와 고춧가루가 1:1 비례하게 넣어준다. 물론 고춧가루 또한 입맛에 따라 알아서 가감
4. 절여놨던 오이를 헹구고 물기를 빼 체에 받쳐준다.
4-1. 물기를 너무 빼면 무칠 때 굉장히 퍽퍽해지니 적당히 뺄 것.
5. 양념과 오이를 버무려주며 깨를 적당량 뿌려준다.\n""")
def print_pork_neck():
    print("""<7> 돼지목살간장구이 만들기""")
def print_lettuce_kimchi():
    print("""<9> 상추 겉절이 만들기""")
def print_braised_tofu():
    print("""<11> 두부조림 만들기""")
def print_braised_radish_with_mackerel():
    print("""<13> 무 고등어 조림 만들기""")