
print("""랜덤한 저녁 메뉴 고르기(반찬, 국 중 하나만) : 1
랜덤한 저녁 메뉴 고르기(반찬, 국 둘 다) : 2
저녁 메뉴 레시피 보기 :3
종료하기 : 4\n""")

# 무한 반복
while True:
    dinner = int(input(""))
    # 랜덤한 숫자 뽑아내기
    import random
    random_number_1 = random.randint(1, 9)
    random_number_2 = random.randint(1, 9)
    # 1 입력시 랜덤한 숫자 출력 후 문장 출력 및 9번줄로 돌아감
    if dinner == 1:
        print(f"""{random_number_1}\n1 >> 반찬 복불복으로  2 >> 반찬, 국 복불복으로    3 >> 메뉴로    4 >> 종료""")
    # 2 입력시 랜덤한 숫자 두개 출력 후 문장 출력 및 9번줄로 돌아감
    elif dinner == 2:
        print(f"""{random_number_1}, {random_number_2}\n1 >> 반찬 복불복으로  2 >> 반찬, 국 복불복으로    3 >> 메뉴로    4 >> 종료""")
    # 3 입력시 메뉴판 출력
    elif dinner == 3:
        print("""MENU
밥                   국
<1> 갈배제육        
<2> 고등어 갈비구이
<3> 오이부추무침     
<4> 돼지목살 간장구이
<5> 상추 겉절이      
<6> 두부조림
<7> 무 고등어 조림   
<8> 돼지김치짜글이

<0> 처음으로""")
        food = int(input("메뉴의 번호를 입력하세요!\n"))
        # 0 입력시 문장 출력 후 9번줄로 돌아감
        if food == 0:
            print("1 >> 반찬 복불복으로  2 >> 반찬, 국 복불복으로    3 >> 메뉴로    4 >> 종료")
        # 1 입력시 1에 해당하는 레시피 출력 후 9번줄로 돌아감
        elif food == 1:
            print("갈배제육 만드는 법\n\n")
            print("""주재료                          양념     
            돼지고기 앞다리 살 600그램          고추장 듬뿍 세 숟갈
            어슷 썬 대파                     간장 두 숟갈
            양파 반개                        설탕 두 숟갈
            소금 한 꼬집                     배 음료 한 캔
                                           다진 마늘 한 숟갈 

                                           식초 두 숟갈
                                           참기름 한 숟갈\n\n""")
            print("""만드는 법
            1. 고기의 핏물을 닦아 준다.
            2. 고추장에서 다진 마늘까지의 양념을 잘 섞어준다.
            3. 양념과 고기를 잘 섞어준 후 식초와 참기름을 넣어준다.(식초는 연육 적용과 감칠맛을 올려주고 보관 기간을 늘려주며 고기를 신맛은 볶을때 사라진다.)
            4. 어슷 썬 채소들은 고기 위에 올려주고(섞기X) 소금 한 꼬집을 뿌려준다.\n""")
            print("""굽는 법
            1. 고기를 먼저 올려 거뭇한 부분이 생길때까지 기다린다.(거뭇한 부위는 감칠맛을 올려줌)
            2. 어느 정도 거뭇한 분이 생기면 채소들을 넣어 같이 볶아준 후 뚜껑을 덮고 약불로 3분을 익혀준다.
            3. 마무리로 으깬 마늘을 한 숟갈 넣어 섞어주고 후추를 뿌려준다.\n
            1 >> 반찬 복불복으로  2 >> 반찬, 국 복불복으로    3 >> 메뉴로    4 >> 종료\n""")
        elif food == 2:
            print("고등어 갈비구이 만드는 법")
            print("""주재료                양념
            고등어 한마리             밀가루
            다진 파 반움큼            맛술

                                    고추장 한스푼
                                    고춧가루 한스푼
                                    다진 마늘 반스푼
                                    간장 반스푼
                                    들기름 한스푼
                                    설탕 반스푼
                                    올리고당 한스푼
                                    맛술 한스푼
                                    후추 살짝
                                    깨 적당히\n\n""")
            print("""만드는 과정
            1. 고등어를 물에 담근 후 맛술 한스푼, 후추 살짝, 밀가루 적당량을 넣어 비린내를 제거한다. 대략 30분
            2. 양념들과 다진 파를 잘 섞어준다.
            2-1. 여기서 양념은 자기 입맛에 따라 조절한다. 자반 고등어일 경우 간장은 한스푼이 아닌 살짝만 넣어도 된다.
            3. 비린내를 제거한 고등어에 밀가루를 뿌리고 고등어를 굽는다.
            3-1. 밀가루를 입혀주면 기름이 잘 튀지 않는다.
            4. 앞뒤로 5~10분정도 구운 후 양념을 위에 골고루 발라준다.
            5. 불을 약불로 줄이거나 완전히 끈 후 뚜껑을 덮어 3분가량 익혀준다.
            5-1. 불을 끈 후 고등어를 뒤집어 반대편에도 양념을 발라준다. 굽는건 자기가 알아서 적당히.\n
            1 >> 반찬 복불복으로  2 >> 반찬, 국 복불복으로    3 >> 메뉴로    4 >> 종료\n""")
        elif food == 3:
            print("미정")
        elif food == 4:
            print("미정")
        elif food == 5:
            print("미정")
        elif food == 6:
            print("미정")
        elif food == 7:
            print("미정")
        elif food == 8:
            print("돼지김치짜글이\n")
            print("""주재료                   양념
            1. 앞다리 살              1. 들기름 반스푼
            2. 신김치 반포기 이하       2. 올리브유 반스푼
            3. 대파                  3. 고추장 한스푼
            4. 양파 반개              4. 고춧가루 한스푼
                                    5. 다진 마늘 한스푼
                                    6. 간장 한스푼
                                    7. 설탕 한스푼
                                    8. 맛술 반스푼
                                    9. 후추 살짝\n\n""")
            print("""만드는 법
            1. 앞다리 살에 맛술과 후추를 뿌려 30분가량 상온에 놔둔다
            1-1. 위 과정은 고기의 잡내를 잡기 위함이며 하지 않아도 상관없다
            2. 냄비에 들기름 반, 올리브유 반을 부은 후 파와 함께 살짝 볶으며 파기름을 내준다
            3. 고기를 넣어 중불로 2,3분 가량 볶아준다
            3-1. 이때 고기를 재지 않았으면 맛술 반스푼과 후추를 살짝 뿌려준다
            4. 고추장 한스푼, 고춧가루 한스푼, 다진 마늘 한스푼, 설탕 한스푼, 간장 한스푼을 넣어 중불로 2분가량 볶아준다
            4-1. 위의 양념은 자신의 입맛에 따라 가감한다
            5. 얇게 썬 김치와 양파를 넣어 같이 볶아준다
            5-1. 이때 김치를 그냥 썰어 넣으면 김치의 속과 김치 국물에 의해 너무 짜질 수 있으니 칼로 속을 긁어내고 김치를 어느 정도 짜준다.
            6. 양파가 반투명하게 변하면 물을 700ml 가량 넣어준다
            7. 강불로 끓이며 적당히 졸인다\n
            1 >> 반찬 복불복으로  2 >> 반찬, 국 복불복으로    3 >> 메뉴로    4 >> 종료\n""")

        #메뉴판 이외의 숫자 입력 시 문장 출력 후 9번줄로 돌아감
        else:
            print("팔지 않는 메뉴입니다. 다시 입력해 주세요!\n")
    # 코드 종료
    else:
        print("장비를 정지합니다.")
        # 코드 이탈
        break
    # 다시 while 문으로 돌아감
    continue